//1. 给定两个整形变量的值，将两个值的内容进行交换。 
//#include <stdio.h>
//int main()
//{
//	int a=2;
//	int b=3;
//	int c=0;
//	c = a;//c=2
//	a = b;//a=3
//	b = c;//b=2
//	printf("  a=%d\n  b=%d", a, b);
//	return 0;
//}
//=========================================================================================01

//2. 不允许创建临时变量，交换两个数的内容（附加题）
//解法1：利用加法运算
//#include<stdio.h>
//int main()
//{
//	int a = 6;
//	int b = 7;
//	a = a + b;//a=13
//	b = a - b;//b=6
//	a = a - b;//a=7
//	printf("a=%d\nb=%d", a, b);
//	return 0;
//}

//解法2：用异或^的方式
//#include <stdio.h>
//int main()
//{
//	int a = 4;//0100
//	int b = 5;//0101
//	a = a^b;//0001 a=1
//	b = a^b;//0001^0101=0100  b=4
//	a = a^b;//0001^0100=0101  a=5
//	printf("a=%d\nb=%d", a, b);
//	return  0;
//}
//=========================================================================================02

//3.求10 个整数中最大值。
//思路，先输出10个随机整数，再求这10个数中的最大值
//#include <stdio.h>
//#include <stdlib.h>
//#include <time.h> //用到了time函数 
//int main()
//{
//	int i = 0;
//	int number=0;
//	int max = 0;
//	srand((unsigned)time(NULL)); //用时间做种，每次产生随机数不一样
//	for (i = 0; i < 10; i++)//产生10个数
//	{
//		number = rand() % 101;  //产生0-100的随机数
//		printf("随机数number=%d\n\n", number);
//		if (number>max)
//		{
//			max = number;
//		}
//	}
//	printf("最大值max=%d\n\n", max);
//	return 0;
//}
//=========================================================================================03
//4.将三个数按从大到小输出。
//#include <stdio.h>
//int main()
//{
//	int a = 22, b = 33, c = 44;
//	int t = 0;
//	if (a<b);
//	{   t = a; a = b; b = t;   }
//	if (a<c);
//	{	t = a; a = c; c = t;   }
//	if (b<c);
//	{	t = b; b = c; c = t;   }
//	printf("他们的顺序是\n  a=%d  b=%d  c=%d",a,b,c);
//	return 0;
//}
//=========================================================================================04
//5.求两个数的最大公约数。
//如果一个数C既是数A的约数，又是数B的约数，C便是A,B的公约数
//辗转相除法实现 
#include <stdio.h>
int main()
{
	int a = 25;
	int b = 70;
	int num = 0;
	if (a < b)
	{
		num = a;
		a = b;
		b = num;
	}
	while (a%b != 0)
	{
		num = a%b;
		a = b;
		b = num;
	}
	printf("最大公约数为：%d\n", b);
	return 0;
}
//=========================================================================================05
