//2019_09_23   千与千寻
//=======================================================================================================01
////1. 将数组A中的内容和数组B中的内容进行交换。（数组一样大）
//#include <stdio.h>
//int arr_1[] = { 1, 2, 3, 4,  5,  6  };
//int arr_2[] = { 7, 8, 9, 10, 11, 12 };
//int arr_3[] = {0};
//int i = 0;
//int change = 0;
//int main()
//{
//	//=========================交换前
//	printf("交换前\n");
//	printf("第一个数组是:\n");
//	for (i = 0; i < 6; i++)
//	{
//		printf("%d  ", arr_1[i]);
//	}
//	printf("\n第二个数组是:\n");
//	for (i = 0; i < 6; i++)
//	{
//		printf("%d  ", arr_2[i]);
//	}
//	//=========================交换后
//	printf("\n\n交换后\n");
//	printf("第一个数组是:\n");
//	for (i = 0; i < 6; i++)
//	{
//		change = arr_1[i];
//		arr_1[i] = arr_2[i];
//		arr_2[i] = change;
//		printf("%d  ", arr_1[i]);
//	}
//	printf("\n第二个数组是:\n");
//	for (i = 0; i < 6; i++)
//	{
//		printf("%d  ", arr_2[i]);
//	}
//}
//=======================================================================================================02
//2. 计算1 / 1 - 1 / 2 + 1 / 3 - 1 / 4 + 1 / 5 …… + 1 / 99 - 1 / 100 的值。
//#include<stdio.h>
//int main()
//{
//	int i = 1;
//	float n = 1.0;
//	float sum = 0.0;
//	for (i = 1; i <= 100; i++)
//	{
//		if (i%2 == 0)//是偶数，前面为负
//		{
//			n = -1.0/i ;//此处一定要是1.0
//		}
//		else//是奇数，前面为正
//		{
//			n =1.0/i;
//		}
//			sum += n;
//	}
//printf("计算结果为：%f\n", sum);
//	return 0;
//}


//=======================================================================================================03
////3. 编写程序数一下 1到 100 的所有整数中出现多少次数字9。
////思路：只判断个位和十位上是否有9就可以了
//#include<stdio.h>
//int main()
//{
//	int i = 0;
//	int cnt = 0;
//	for (i = 1; i <= 100; i++)
//	{
//		if (i % 10 == 9)
//			cnt++;
//	}
//	printf("出现9的次数是：%d次\n",cnt);
//		return 0;
//}


