//=====================================================================================01
//1.在屏幕上输出以下图案：
//思路：分空格和*打印
//*
//***
//*****
//*******
//*********
//***********
//*************
//***********
//*********
//*******
//*****
//***
//*
//
//#include<stdio.h>
//int main()
//{
//	char arr[] = "*************";
//	int size = sizeof(arr) / sizeof(arr[0])-1;
//	int i = 0;
//	int k = 0;
//	int c = 0;
//	for (i = 1; i <= size; i++)
//	{
//		if (i <= size / 2+1)
//		  {
//		   c = 2*i-1;
//				for (k = 1; k <= c; k++)		//n行2n-1个*
//				{
//					printf("* ");
//				}
//				//换行
//				printf("\n");
//		  }
//	}
//	return 0;
//}



//=====================================================================================02
//2.求出0～999之间的所有“水仙花数”并输出。
//“水仙花数”是指一个三位数，其各位数字的立方和恰好等于该数本身，如；153＝1＋5＋3 ? ，则153是一个“水仙花数”。
///*
//在数论中，水仙花数（Narcissistic number）也称为自恋数、自幂数、阿姆斯壮数或阿姆斯特朗数（Armstrong number），是指一N位数，其各个数之N次方和等于该数。
//例如153、370、371及407就是三位数的水仙花数，其各个数之立方和等于该数：
//153 = 1^3 + 5^3 + 3^3。
//370 = 3^3 + 7^3 + 0^3。
//371 = 3^3 + 7^3 + 1^3。
//407 = 4^3 + 0^3 + 7^3。
//*/

//#include <stdio.h>
//int main()
//{
//	int i = 99;
//	int num = 99;//因为水仙花是一个3位数
//	int sum = 0;
//	int kk = 0;
//	int a, b, c;
//	for (i = 99; i < 999; i++)
//	{
//		num++;
//		a = num %10;//个位 
//		b = (num %100)/10;//十位
//		c = num/100;//百位  
//		sum = a*a*a + b*b*b + c*c*c;
//
//		if (sum == num)
//		{
//			printf("%d%d%d\n", c, b, a);
//			printf("水仙花有：%d\n", num);
//		}
//	 }
//	return 0;
//}


//=====================================================================================03
//3.
//求Sn = a + aa + aaa + aaaa + aaaaa的前5项之和，其中a是一个数字，
//例如：2 + 22 + 222 + 2222 + 22222
//#include<stdio.h>
//int main()
//{
//	int a = 2;
//	int i = 1;
//	int sum = 0;
//	int sn = 0;
//	for (i = 1; i <= 5; i++)
//	{
//		sum = sum * 10 + a;
//		sn = sn + sum;
//	}
//	printf("前5项和=%d\n", sn);
//	return 0;
//}