#define _CRT_SECURE_NO_WARNINGS 1
//===========================================================================01
//1.写一个函数返回参数二进制中 1 的个数
//比如： 15 0000 1111 4 个 1
//程序原型：
//int count_one_bits(unsigned int value)
//{
//	// 返回 1的位数 
//}
//#include <stdio.h>
//int count(int i)
//{
//	int c = 0;
//	while (i)
//	{
//		if (i % 2 == 1)
//		{
//			c++;
//		}
//		i /= 2;
//	}
//	return c;
//
//}
//int main()
//{
//
//	int i = 13;  //13的二进制是 1101
//	int c = count(i);
//	printf("%d\n", c);//3
//	return 0;
//}

//===========================================================================02
//2.获取一个数二进制序列中所有的偶数位和奇数位，分别输出二进制序列。
//比如11的二进制为01011
//输出为  奇数序列 : 0 0 1
//        偶数序列 : 1 1

//#include <stdio.h>  
//int main()
//{
//	int num = 0, i = 0;
//	scanf("%d", &num);
//	printf("偶数序列为：");
//	for (i = 31; i >= 0; i -= 2)  //也是控制32次（每个整型数按32位来算），只是从31位开始移动  
//	{
//		printf("%d ", (num >> i) & 1);  //第一次向右移动31位和1与得到第一位情况，每次变化2位，即可得到偶数位情况  
//	}
//	printf("\n");
//	printf("奇数序列为：");
//	for (i = 30; i >= 0; i -= 2)  //向右移动30位，再与1所得结果是原来数字的第二位，再移28位...  
//	{
//		printf("%d ", (num >> i) & 1);  //  
//	}
//	printf("\n");
//
//	return 0;
//}
//===========================================================================03
//3. 输出一个整数的每一位。
//思路：拆分整数的每一位，然后打印一下（例如：12 ，首先12%10拿出来2，然后在12/10剩余1，打印出来就好了）
//#include<stdio.h>
//
////(1)递归
//void play(int x)
//{
//	if (x != 0)
//	{
//		play(x / 10);//先除后模，是正序排列   先模后除，是逆序排列
//		printf("%d,", x % 10);
//	}
//}
////（2）非递归
//void play2(int x2)
//{
//	while (x2)
//	{
//		printf("%d   ", x2 % 10);
//		x2 /= 10;
//	}
//	printf("\n");
//}
//int main()
//{
//	int i, j, k;
//	printf("输入一个数：");
//	scanf("%d", &k);
//	play(k);
//	printf("\n");
//	play2(k);
//	return 0;
//}


//===========================================================================04
//4.编程实现：两个int（32位）整数m和n的二进制表达中，有多少个位(bit)不同？
//输入例子 :1999 2299   输出例子 : 7
//思路：利用位操作中的“异或”。异或的特征：相同为0.相异为1。
//先利用两个数进行“异或”操作，得到一个值value，然后问题就演变成了数出这个值value中1的个数

#include<stdio.h>
#include<stdlib.h>
//两个int（32位）整数m和n的二进制表达中，有多少个位(bit)不同？
int Dif_bits(int m, int n)
{
	//异或的特征：相同为0.相异为1
	//所以先异或得到一个值，然后数出这个值中1的个数
	int count = 0;
	int value = m^n;
	while (value != 0)
	{
		if ((value & 1) == 1)
		{
			count++;
		}
		value = value >> 1;
	}
	return count;
}
int main()
{
	int num1, num2;
	printf("请输入两个int（32位）整数：>");
	scanf("%d %d", &num1, &num2);
	int count = Dif_bits(num1, num2);
	printf("%d", count);
	system("pause");
	return 0;
}